pizza_orders/app/controllers/orders_controller.rb

  def index
    @orders = Order.open.includes(order_items: :pizza).order(created_at: :asc)
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (6, 4, 5)

  def update
    order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1