pizza_orders/app/views/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (1, 2, 3)
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (6, 4, 5)
---
      <ul>
        <% order.order_items.each do |item| %>
          <li>
            <%= item.pizza.name %> (<%= item.size %>)